# Homebrew Bundle Configuration
# This file manages all Homebrew packages, casks, and VS Code extensions

# CLI Tools
brew "awscli"
brew "cloud-sql-proxy"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gnupg"
brew "go"
brew "go@1.21"
brew "go@1.22"
brew "goenv"
brew "golang-migrate"
brew "golangci-lint"
brew "mise"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "postgresql@14"
brew "terraform"
brew "tmux"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks (Applications)
cask "cursor"
cask "font-hack-nerd-font"
cask "gcloud-cli"

# VS Code Extensions
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dwtexe.cursor-stats"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "lokalise.i18n-ally"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "premparihar.gotestexplorer"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
